nxp-appcodehub/ap-ml-state-monitor/ml_state_monitor/mcu_app/boards/evkmimxrt1170/ml_state_monitor_mpp/pin_mux.c
/*
 * Copyright 2020-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v9.0
processor: MIMXRT1176xxxxx
package_id: MIMXRT1176DVMAA
mcu_data: ksdk2_0
processor_version: 0.9.6
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitLpuartPins();
    /* SD card GPIO initialization */
          IOMUXC_SetPinMux(
              IOMUXC_GPIO_AD_32_GPIO_MUX3_IO31,       /* GPIO_AD_32 is configured as GPIO_MUX3_IO31 */
              0U);                                    /* Software Input On Field: Input Path is determined by functionality */
          IOMUXC_SetPinMux(
              IOMUXC_GPIO_AD_34_USDHC1_VSELECT,       /* GPIO_AD_34 is configured as USDHC1_VSELECT */
              0U);                                    /* Software Input On Field: Input Path is determined by functionality */
          IOMUXC_SetPinMux(
              IOMUXC_GPIO_AD_35_GPIO10_IO02,          /* GPIO_AD_35 is configured as GPIO10_IO02 */
              0U);                                    /* Software Input On Field: Input Path is determined by functionality */
          IOMUXC_SetPinMux(
              IOMUXC_GPIO_SD_B1_00_USDHC1_CMD,        /* GPIO_SD_B1_00 is configured as USDHC1_CMD */
              1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_00 */
          IOMUXC_SetPinMux(
              IOMUXC_GPIO_SD_B1_01_USDHC1_CLK,        /* GPIO_SD_B1_01 is configured as USDHC1_CLK */
              1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_01 */
          IOMUXC_SetPinMux(
              IOMUXC_GPIO_SD_B1_02_USDHC1_DATA0,      /* GPIO_SD_B1_02 is configured as USDHC1_DATA0 */
              1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_02 */
          IOMUXC_SetPinMux(
              IOMUXC_GPIO_SD_B1_03_USDHC1_DATA1,      /* GPIO_SD_B1_03 is configured as USDHC1_DATA1 */
              1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_03 */
          IOMUXC_SetPinMux(
              IOMUXC_GPIO_SD_B1_04_USDHC1_DATA2,      /* GPIO_SD_B1_04 is configured as USDHC1_DATA2 */
              1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_04 */
          IOMUXC_SetPinMux(
              IOMUXC_GPIO_SD_B1_05_USDHC1_DATA3,      /* GPIO_SD_B1_05 is configured as USDHC1_DATA3 */
              1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_05 */
          IOMUXC_GPR->GPR43 = ((IOMUXC_GPR->GPR43 &
            (~(IOMUXC_GPR_GPR43_GPIO_MUX3_GPIO_SEL_HIGH_MASK))) /* Mask bits to zero which are setting */
              | IOMUXC_GPR_GPR43_GPIO_MUX3_GPIO_SEL_HIGH(0x8000U) /* GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function: 0x8000U */
            );
          IOMUXC_SetPinConfig(
              IOMUXC_GPIO_SD_B1_00_USDHC1_CMD,        /* GPIO_SD_B1_00 PAD functional properties : */
              0x04U);                                 /* PDRV Field: high drive strength
                                                         Pull Down Pull Up Field: Internal pullup resistor enabled
                                                         Open Drain Field: Disabled
                                                         Domain write protection: Both cores are allowed
                                                         Domain write protection lock: Neither of DWP bits is locked */
          IOMUXC_SetPinConfig(
              IOMUXC_GPIO_SD_B1_01_USDHC1_CLK,        /* GPIO_SD_B1_01 PAD functional properties : */
              0x0CU);                                 /* PDRV Field: high drive strength
                                                         Pull Down Pull Up Field: No Pull
                                                         Open Drain Field: Disabled
                                                         Domain write protection: Both cores are allowed
                                                         Domain write protection lock: Neither of DWP bits is locked */
          IOMUXC_SetPinConfig(
              IOMUXC_GPIO_SD_B1_02_USDHC1_DATA0,      /* GPIO_SD_B1_02 PAD functional properties : */
              0x04U);                                 /* PDRV Field: high drive strength
                                                         Pull Down Pull Up Field: Internal pullup resistor enabled
                                                         Open Drain Field: Disabled
                                                         Domain write protection: Both cores are allowed
                                                         Domain write protection lock: Neither of DWP bits is locked */
          IOMUXC_SetPinConfig(
              IOMUXC_GPIO_SD_B1_03_USDHC1_DATA1,      /* GPIO_SD_B1_03 PAD functional properties : */
              0x04U);                                 /* PDRV Field: high drive strength
                                                         Pull Down Pull Up Field: Internal pullup resistor enabled
                                                         Open Drain Field: Disabled
                                                         Domain write protection: Both cores are allowed
                                                         Domain write protection lock: Neither of DWP bits is locked */
          IOMUXC_SetPinConfig(
              IOMUXC_GPIO_SD_B1_04_USDHC1_DATA2,      /* GPIO_SD_B1_04 PAD functional properties : */
              0x04U);                                 /* PDRV Field: high drive strength
                                                         Pull Down Pull Up Field: Internal pullup resistor enabled
                                                         Open Drain Field: Disabled
                                                         Domain write protection: Both cores are allowed
                                                         Domain write protection lock: Neither of DWP bits is locked */
          IOMUXC_SetPinConfig(
              IOMUXC_GPIO_SD_B1_05_USDHC1_DATA3,      /* GPIO_SD_B1_05 PAD functional properties : */
              0x04U);                                 /* PDRV Field: high drive strength
                                                         Pull Down Pull Up Field: Internal pullup resistor enabled
                                                         Open Drain Field: Disabled
                                                         Domain write protection: Both cores are allowed
                                                         Domain write protection lock: Neither of DWP bits is locked */
}

