nxp-appcodehub/ap-ml-state-monitor/ml_state_monitor/mcu_app/boards/evkmimxrt1170/ml_state_monitor_mpp/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLpuartPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: M15, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AD_25}
  - {pin_num: L13, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AD_24}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLpuartPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLpuartPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 is configured as LPUART1_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 is configured as LPUART1_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
LPI2C1_InitPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: R15, peripheral: LPI2C1, signal: SCL, pin_signal: GPIO_AD_08, software_input_on: Enable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Enable, drive_strength: Normal, slew_rate: Slow}
  - {pin_num: R16, peripheral: LPI2C1, signal: SDA, pin_signal: GPIO_AD_09, software_input_on: Enable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Enable, drive_strength: Normal, slew_rate: Slow}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPI2C1_InitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void LPI2C1_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

//  IOMUXC_SetPinMux(
//          IOMUXC_GPIO_AD_08_GPIO9_IO07,           /* GPIO_AD_08 is configured as LPI2C1_SCL */
//      0U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_08 */
//  IOMUXC_SetPinMux(
//          IOMUXC_GPIO_AD_08_GPIO9_IO07,           /* GPIO_AD_09 is configured as LPI2C1_SDA */
//      0U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_09 */
//  IOMUXC_SetPinConfig(
//          IOMUXC_GPIO_AD_08_GPIO9_IO07,           /* GPIO_AD_08 PAD functional properties : */
//      0x00U);                                 /* Slew Rate Field: Slow Slew Rate
//                                                 Drive Strength Field: normal drive strength
//                                                 Pull / Keep Select Field: Pull Disable, Highz
//                                                 Pull Up / Down Config. Field: Weak pull down
//                                                 Open Drain Field: Enabled
//                                                 Domain write protection: Both cores are allowed
//                                                 Domain write protection lock: Neither of DWP bits is locked */
//  IOMUXC_SetPinConfig(
//          IOMUXC_GPIO_AD_08_GPIO9_IO07,           /* GPIO_AD_09 PAD functional properties : */
//      0x00U);                                 /* Slew Rate Field: Slow Slew Rate
//                                                 Drive Strength Field: normal drive strength
//                                                 Pull / Keep Select Field: Pull Disable, Highz
//                                                 Pull Up / Down Config. Field: Weak pull down
//                                                 Open Drain Field: Enabled
//                                                 Domain write protection: Both cores are allowed
//                                                 Domain write protection lock: Neither of DWP bits is locked */

  /* GPIO configuration on GPIO_AD_04 (pin M13) */
//  gpio_pin_config_t gpio9_pinM13_config = {
//      .direction = kGPIO_DigitalOutput,
//      .outputLogic = 0U,
//      .interruptMode = kGPIO_NoIntmode
//  };
  /* Initialize GPIO functionality on GPIO_AD_04 (pin M13) */
//  GPIO_PinInit(GPIO9, 7U, &gpio9_pinM13_config);
//  GPIO_PinInit(GPIO9, 8U, &gpio9_pinM13_config);

//  IOMUXC_SetPinMux(
//          IOMUXC_GPIO_AD_08_GPIO9_IO07,           /* GPIO_AD_04 is configured as GPIO9_IO03 */
//      0U);                                    /* Software Input On Field: Input Path is determined by functionality */

//  IOMUXC_SetPinMux(
//          IOMUXC_GPIO_AD_09_GPIO9_IO08,           /* GPIO_AD_04 is configured as GPIO9_IO03 */
//      0U);                                    /* Software Input On Field: Input Path is determined by functionality */

//  for(int i = 0xFFFFFFF/8; i--; i>0);
//  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */


  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_08_LPI2C1_SCL,           /* GPIO_AD_08 is configured as LPI2C1_SCL */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_08 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_09_LPI2C1_SDA,           /* GPIO_AD_09 is configured as LPI2C1_SDA */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_09 */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_08_LPI2C1_SCL,           /* GPIO_AD_08 PAD functional properties : */
      0x18U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal drive strength
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Enabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_09_LPI2C1_SDA,           /* GPIO_AD_09 PAD functional properties : */
      0x18U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal drive strength
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Enabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */

