nxp-appcodehub/ap-ml-state-monitor/ml_state_monitor/mcu_app/boards/evkmimxrt1170/ml_state_monitor_mpp/pin_mux.c
//  /*
//   * Pull-up enable for SA0 pin on the FRDM-STBI-A8974 shield
//   * Without this workaround the sensor cannot be properly initialized
//   */
//  IOMUXC_SetPinMux(
//      IOMUXC_GPIO_AD_31_GPIO9_IO30,           /* GPIO_AD_31 is configured as GPIO9_IO30 */
//      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
//
//  IOMUXC_SetPinConfig(
//      IOMUXC_GPIO_AD_31_GPIO9_IO30,           /* GPIO_AD_31 PAD functional properties : */
//      0x0CU);                                 /* Slew Rate Field: Slow Slew Rate
//                                                 Drive Strength Field: normal drive strength
//                                                 Pull / Keep Select Field: Pull Enable
//                                                 Pull Up / Down Config. Field: Weak pull up
//                                                 Open Drain Field: Disabled
//                                                 Domain write protection: Both cores are allowed
//                                                 Domain write protection lock: Neither of DWP bits is locked */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
LPI2C1_DeinitPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: R15, peripheral: GPIO3, signal: 'gpio_mux_io, 07', pin_signal: GPIO_AD_08, software_input_on: Disable}
  - {pin_num: R16, peripheral: GPIO3, signal: 'gpio_mux_io, 08', pin_signal: GPIO_AD_09, software_input_on: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPI2C1_DeinitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void LPI2C1_DeinitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_08_GPIO_MUX3_IO07,       /* GPIO_AD_08 is configured as GPIO_MUX3_IO07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_09_GPIO_MUX3_IO08,       /* GPIO_AD_09 is configured as GPIO_MUX3_IO08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_GPR->GPR42 = ((IOMUXC_GPR->GPR42 &
    (~(IOMUXC_GPR_GPR42_GPIO_MUX3_GPIO_SEL_LOW_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR42_GPIO_MUX3_GPIO_SEL_LOW(0x00U) /* GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function: 0x00U */
    );
}


/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
